{
  "headline": "Driven by curiosity, endless exploration and a need to make the world a better place.",
  "body": "## Early beginnings\nIn my youth, I’ve discovered a passion for drawing and painting. After producing many of those since I was 10 I tried to find a way to move my artwork to the digital world. My goal was to build a website and share my work with others. This is how I learned how to code, how to design for web, playing around with DHTML with a crappy looking result. Every single iteration, driven by curiosity, was getting better and better. Some of my friends spotted it and at the age of 16, I’ve made my first money from designing websites, business cards, corporate calendars, posters and so on.\n\n## Study\nI wanted to become a geography teacher. I can memorize maps, I can estimate weather change, that was something I liked. Current salaries for teachers scared me away and I had a new profession in mind: an advertising specialist. I studied advertising in Warsaw but after two years I’ve decided that I don’t want to create commercials for pills for haemorrhoids or constant back pain. \n\nAfter a short break, I’ve ended up studying graphic design and journalism which was overwhelmingly boring so I quit. My next studies were back again in Warsaw where I studied graphic design with fine arts. I was the A student with most of the skills and already with some professional experience. I’ve never finished those studies as I pursued my intense career.\n\n## Career\nI have always worked and studied at the same time. I started like most of us: working in a crappy company, working on small projects, no process, no frameworks, just drive to deliver and meet the deadline. Chaos. I felt that something is missing. Then everything has changed when I joined PayU (Allegro Group) and I’ve become a UX/UI designer for the mobile wallet product. Then I knew what I really want to do and how to direct my career. \n\nWarsaw was enough and I moved to London to taste startup life. I’ve learned a lot, I worked with many clients, managing many stakeholders, keeping up with the development team, testing ideas, optimising and launching products. Thanks to the team from ucreate.it, I’ve mastered my skills with Business Model Canvas, Value Proposition Canvas and User Story Mapping. \n\nI’ve never played golf but I’ve designed and delivered MyPocketPro (online golf coach), MHSystems (golf club and course management platform - one of the biggest platforms in the UK), and a social platform, Your Golf Manager, for professional and amateur golf players. I was behind the very first version of the Kids Know Best platform that has grown big and the guys are doing really well!\n\nAfter some time at ucreate, I have found my way to Kite.ly where I was responsible for the mobile and web SDK for the print-on-demand platform. I’ve learned about e-commerce, customer support (and a gold mine of user feedback from it) which helped me deliver better experiences and the tools that merchants really need.\n\nApplying to Adyen was very spontaneous and I just wanted to find out if I’m good enough to work for such a big company. I was amazed by them, they were amazed by me. Thanks to that I’m happy to work on critical financial solutions for the internal purposes and also the financial suite designated for the customers. \n\n## Passions\nI’m passionate about modern art. I paint most of the time after work. From time to time I grab my analogue camera and shoot photos on the 35mm film. My library is full of books about astronomy, astrophysics, physics, black holes, psychology and self-improvement. I write occasionally, I play the ukulele and piano.\n\nA few times a year I leave my “art” cave and go travelling to meet new people, learn about different cultures and just switch off from the daily routines and work."
}